SAP ISR/ZBAPI_ACC_DOCUMENT_POST_Sample_Data_5000_7600.xml

<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:SOAP-ENC="http://schemas.xmlsoap.org/soap/encoding/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema">
	<SOAP-ENV:Body>
		<m:ZbapiAccDocumentPost xmlns:m="urn:sap-com:document:sap:soap:functions:mc-style">
			<Accountgl>
				<item>
					<ItemnoAcc>0000000001</ItemnoAcc>
					<GlAccount>0077900000</GlAccount>
					<ItemText></ItemText>
					<RefKey1></RefKey1>
					<RefKey2></RefKey2>
					<RefKey3></RefKey3>
					<BusArea>5000</BusArea>
					<AllocNmbr></AllocNmbr>
					<Costcenter>JM12JMHOOP</Costcenter>
					<ProfitCtr>JMJMHOOP</ProfitCtr>
				</item>
				<item>
					<ItemnoAcc>0000000002</ItemnoAcc>
					<GlAccount>0023000120</GlAccount>
					<ItemText></ItemText>
					<RefKey1></RefKey1>
					<RefKey2></RefKey2>
					<RefKey3></RefKey3>
					<BusArea>5000</BusArea>
					<AllocNmbr></AllocNmbr>
					<Costcenter>JM12JMHOOP</Costcenter>
					<ProfitCtr>JMJMHOOP</ProfitCtr>
				</item>
			</Accountgl>
			<Accountpayable/>
			<Accountreceivable/>
			<Accounttax/>
			<Accountwt/>
			<Contractheader/>
			<Contractitem/>
			<Criteria/>
			<Currencyamount>
				<item>
					<ItemnoAcc>0000000001</ItemnoAcc>
					<CurrType></CurrType>
					<Currency>LKR</Currency>
					<CurrencyIso></CurrencyIso>
					<AmtDoccur>1000.00</AmtDoccur>
					<ExchRate>1.00</ExchRate>
				</item>
				<item>
					<ItemnoAcc>0000000002</ItemnoAcc>
					<CurrType></CurrType>
					<Currency>LKR</Currency>
					<CurrencyIso></CurrencyIso>
					<AmtDoccur>1000.00-</AmtDoccur>
					<ExchRate>1.00</ExchRate>
				</item>
			</Currencyamount>
			<Customercpd/>
			<Documentheader>
				<ObjType></ObjType>
				<ObjKey></ObjKey>
				<ObjSys></ObjSys>
				<BusAct>RFBU</BusAct>
				<Username>AHPL_RFC</Username>
				<HeaderTxt>TEST2</HeaderTxt>
				<CompCode>7600</CompCode>
				<DocDate>2012-08-31</DocDate>
				<PstngDate>2012-08-31</PstngDate>
				<DocType>SA</DocType>
				<RefDocNo>SA-20130513-002</RefDocNo>
				<AccPrinciple></AccPrinciple>
			</Documentheader>
			<Extension1/>
			<Extension2/>
			<Paymentcard/>
			<Realestate/>
			<Return/>
			<Valuefield/>
		</m:ZbapiAccDocumentPost>
	</SOAP-ENV:Body>
</SOAP-ENV:Envelope>
